[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:29:28
  * @param {Array} collection of numbers.
  * @return {Number} sum of numbers in array.
  */
-basic.sum = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
-    var total = 0;
-    for (var i = 0; i < arr.length; i++) {
-      if (typeof (arr[i]) === 'number') {
-        total = total + arr[i];
-      } else {
-        throw new Error('All elements in array must be numbers');
-      }
-    }
-    return total;
-  } else {
-    throw new Error('Input must be of type Array');
-  }
-};
+basic.sum = function (arr) {};
 
 /**
killedBy: numbers sum should return the sum of items in an array
statusReason: undefined == 6

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:30:7
  * @return {Number} sum of numbers in array.
  */
 basic.sum = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
+  if (true) {
     var total = 0;
     for (var i = 0; i < arr.length; i++) {
killedBy: numbers sum should throw an exception when given anything but an array
statusReason: Missing expected exception.

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:30:7
  * @return {Number} sum of numbers in array.
  */
 basic.sum = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
+  if (false) {
     var total = 0;
     for (var i = 0; i < arr.length; i++) {
killedBy: numbers sum should return the sum of items in an array
statusReason: Input must be of type Array

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:32:21
 basic.sum = function (arr) {
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = 0;
-    for (var i = 0; i < arr.length; i++) {
+    for (var i = 0; i <= arr.length; i++) {
       if (typeof (arr[i]) === 'number') {
         total = total + arr[i];
killedBy: numbers sum should return the sum of items in an array
statusReason: All elements in array must be numbers

[Killed] UpdateOperator
numbers.js/lib/numbers/basic.js:32:37
 basic.sum = function (arr) {
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = 0;
-    for (var i = 0; i < arr.length; i++) {
+    for (var i = 0; i < arr.length; i--) {
       if (typeof (arr[i]) === 'number') {
         total = total + arr[i];
killedBy: numbers sum should return the sum of items in an array
statusReason: All elements in array must be numbers

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:33:11
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = 0;
     for (var i = 0; i < arr.length; i++) {
-      if (typeof (arr[i]) === 'number') {
+      if (true) {
         total = total + arr[i];
       } else {
killedBy: numbers sum should throw an exception when given anything objects other than numbers
statusReason: Missing expected exception.

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:33:41
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = 0;
     for (var i = 0; i < arr.length; i++) {
-      if (typeof (arr[i]) === 'number') {
-        total = total + arr[i];
-      } else {
+      if (typeof (arr[i]) === 'number') {} else {
         throw new Error('All elements in array must be numbers');
       }
killedBy: numbers sum should return the sum of items in an array
statusReason: 0 == 6

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:34:17
     var total = 0;
     for (var i = 0; i < arr.length; i++) {
       if (typeof (arr[i]) === 'number') {
-        total = total + arr[i];
+        total = total - arr[i];
       } else {
         throw new Error('All elements in array must be numbers');
killedBy: numbers sum should return the sum of items in an array
statusReason: -6 == 6

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:35:14
     for (var i = 0; i < arr.length; i++) {
       if (typeof (arr[i]) === 'number') {
         total = total + arr[i];
-      } else {
-        throw new Error('All elements in array must be numbers');
-      }
+      } else {}
     }
     return total;
killedBy: numbers sum should throw an exception when given anything objects other than numbers
statusReason: Missing expected exception.

[Killed] StringLiteral
numbers.js/lib/numbers/basic.js:36:25
       if (typeof (arr[i]) === 'number') {
         total = total + arr[i];
       } else {
-        throw new Error('All elements in array must be numbers');
+        throw new Error("");
       }
     }
killedBy: numbers sum should throw an exception when given anything objects other than numbers
statusReason: The input did not match the regular expression /All elements in array must be numbers/. Input:

'Error'

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:40:10
       }
     }
     return total;
-  } else {
-    throw new Error('Input must be of type Array');
-  }
+  } else {}
 };
 
killedBy: numbers sum should throw an exception when given anything but an array
statusReason: Missing expected exception.

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:53:36
  * @param {Array} collection of numbers.
  * @return {Number} difference.
  */
-basic.subtraction = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
-    var total = arr[0];
-    if (typeof (total) !== 'number') {
-      throw new Error('All elements in array must be numbers');
-    }
-    for (var i = 1, length = arr.length; i < length; i++) {
-      if (typeof (arr[i]) === 'number') {
-        total -= arr[i];
-      } else {
-        throw new Error('All elements in array must be numbers');
-      }
-    }
-    return total;
-  } else {
-    throw new Error('Input must be of type Array');
-  }
-};
+basic.subtraction = function (arr) {};
 
 /**
killedBy: numbers subtraction should return the difference of items in an array
statusReason: undefined == 5

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:54:65
  * @return {Number} difference.
  */
 basic.subtraction = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
-    var total = arr[0];
-    if (typeof (total) !== 'number') {
-      throw new Error('All elements in array must be numbers');
-    }
-    for (var i = 1, length = arr.length; i < length; i++) {
-      if (typeof (arr[i]) === 'number') {
-        total -= arr[i];
-      } else {
-        throw new Error('All elements in array must be numbers');
-      }
-    }
-    return total;
-  } else {
+  if (Object.prototype.toString.call(arr) === '[object Array]') {} else {
     throw new Error('Input must be of type Array');
   }
killedBy: numbers subtraction should return the difference of items in an array
statusReason: undefined == 5

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:54:7
  * @return {Number} difference.
  */
 basic.subtraction = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
+  if (false) {
     var total = arr[0];
     if (typeof (total) !== 'number') {
killedBy: numbers subtraction should return the difference of items in an array
statusReason: Input must be of type Array

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:56:9
 basic.subtraction = function (arr) {
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = arr[0];
-    if (typeof (total) !== 'number') {
+    if (typeof total === 'number') {
       throw new Error('All elements in array must be numbers');
     }
killedBy: numbers subtraction should return the difference of items in an array
statusReason: All elements in array must be numbers

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:56:38
 basic.subtraction = function (arr) {
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = arr[0];
-    if (typeof (total) !== 'number') {
-      throw new Error('All elements in array must be numbers');
-    }
+    if (typeof (total) !== 'number') {}
     for (var i = 1, length = arr.length; i < length; i++) {
       if (typeof (arr[i]) === 'number') {
killedBy: numbers subtraction should throw an exception when given anything objects other than numbers
statusReason: Missing expected exception.

[Killed] StringLiteral
numbers.js/lib/numbers/basic.js:57:23
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = arr[0];
     if (typeof (total) !== 'number') {
-      throw new Error('All elements in array must be numbers');
+      throw new Error("");
     }
     for (var i = 1, length = arr.length; i < length; i++) {
killedBy: numbers subtraction should throw an exception when given anything objects other than numbers
statusReason: The input did not match the regular expression /All elements in array must be numbers/. Input:

'Error'

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:59:42
     if (typeof (total) !== 'number') {
       throw new Error('All elements in array must be numbers');
     }
-    for (var i = 1, length = arr.length; i < length; i++) {
+    for (var i = 1, length = arr.length; i >= length; i++) {
       if (typeof (arr[i]) === 'number') {
         total -= arr[i];
killedBy: numbers subtraction should throw an exception last element is not a number
statusReason: Missing expected exception.

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:59:59
     if (typeof (total) !== 'number') {
       throw new Error('All elements in array must be numbers');
     }
-    for (var i = 1, length = arr.length; i < length; i++) {
-      if (typeof (arr[i]) === 'number') {
-        total -= arr[i];
-      } else {
-        throw new Error('All elements in array must be numbers');
-      }
-    }
+    for (var i = 1, length = arr.length; i < length; i++) {}
     return total;
   } else {
killedBy: numbers subtraction should throw an exception last element is not a number
statusReason: Missing expected exception.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:60:11
       throw new Error('All elements in array must be numbers');
     }
     for (var i = 1, length = arr.length; i < length; i++) {
-      if (typeof (arr[i]) === 'number') {
+      if (typeof arr[i] !== 'number') {
         total -= arr[i];
       } else {
killedBy: numbers subtraction should return the difference of items in an array
statusReason: All elements in array must be numbers

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:60:11
       throw new Error('All elements in array must be numbers');
     }
     for (var i = 1, length = arr.length; i < length; i++) {
-      if (typeof (arr[i]) === 'number') {
+      if (false) {
         total -= arr[i];
       } else {
killedBy: numbers subtraction should return the difference of items in an array
statusReason: All elements in array must be numbers

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:62:14
     for (var i = 1, length = arr.length; i < length; i++) {
       if (typeof (arr[i]) === 'number') {
         total -= arr[i];
-      } else {
-        throw new Error('All elements in array must be numbers');
-      }
+      } else {}
     }
     return total;
killedBy: numbers subtraction should throw an exception last element is not a number
statusReason: Missing expected exception.

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:78:32
  * @param {Array} collection of numbers.
  * @return {Number} product.
  */
-basic.product = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
-    var total = arr[0];
-    if (typeof (total) !== 'number') {
-      throw new Error('All elements in array must be numbers');
-    }
-    for (var i = 1, length = arr.length; i < length; i++) {
-      if (typeof (arr[i]) === 'number') {
-        total = total * arr[i];
-      } else {
-        throw new Error('All elements in array must be numbers');
-      }
-    }
-    return total;
-  } else {
-    throw new Error('Input must be of type Array');
-  }
-};
+basic.product = function (arr) {};
 
 /**
killedBy: numbers product should return the product of items in an array
statusReason: undefined == 24

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:79:65
  * @return {Number} product.
  */
 basic.product = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
-    var total = arr[0];
-    if (typeof (total) !== 'number') {
-      throw new Error('All elements in array must be numbers');
-    }
-    for (var i = 1, length = arr.length; i < length; i++) {
-      if (typeof (arr[i]) === 'number') {
-        total = total * arr[i];
-      } else {
-        throw new Error('All elements in array must be numbers');
-      }
-    }
-    return total;
-  } else {
+  if (Object.prototype.toString.call(arr) === '[object Array]') {} else {
     throw new Error('Input must be of type Array');
   }
killedBy: numbers product should return the product of items in an array
statusReason: undefined == 24

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:79:7
  * @return {Number} product.
  */
 basic.product = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
+  if (true) {
     var total = arr[0];
     if (typeof (total) !== 'number') {
killedBy: numbers product should throw an exception when given anything but an array
statusReason: The input did not match the regular expression /Input must be of type Array/. Input:

'Error: All elements in array must be numbers'

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:81:9
 basic.product = function (arr) {
   if (Object.prototype.toString.call(arr) === '[object Array]') {
     var total = arr[0];
-    if (typeof (total) !== 'number') {
+    if (true) {
       throw new Error('All elements in array must be numbers');
     }
killedBy: numbers product should return the product of items in an array
statusReason: All elements in array must be numbers

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:84:42
     if (typeof (total) !== 'number') {
       throw new Error('All elements in array must be numbers');
     }
-    for (var i = 1, length = arr.length; i < length; i++) {
+    for (var i = 1, length = arr.length; false; i++) {
       if (typeof (arr[i]) === 'number') {
         total = total * arr[i];
killedBy: numbers product should return the product of items in an array
statusReason: 1 == 24

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:85:41
       throw new Error('All elements in array must be numbers');
     }
     for (var i = 1, length = arr.length; i < length; i++) {
-      if (typeof (arr[i]) === 'number') {
-        total = total * arr[i];
-      } else {
+      if (typeof (arr[i]) === 'number') {} else {
         throw new Error('All elements in array must be numbers');
       }
killedBy: numbers product should return the product of items in an array
statusReason: 1 == 24

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:86:17
     }
     for (var i = 1, length = arr.length; i < length; i++) {
       if (typeof (arr[i]) === 'number') {
-        total = total * arr[i];
+        total = total / arr[i];
       } else {
         throw new Error('All elements in array must be numbers');
killedBy: numbers product should return the product of items in an array
statusReason: 0.041666666666666664 == 24

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:87:14
     for (var i = 1, length = arr.length; i < length; i++) {
       if (typeof (arr[i]) === 'number') {
         total = total * arr[i];
-      } else {
-        throw new Error('All elements in array must be numbers');
-      }
+      } else {}
     }
     return total;
killedBy: numbers product should throw an exception when given anything objects other than numbers
statusReason: Missing expected exception.

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:103:31
  * @param {Number} number
  * @return {Number} square of number
  */
-basic.square = function (num) {
-  if (typeof (num) !== 'number') {
-    throw new Error('Input must be a number.');
-  } else {
-    return num * num;
-  }
-
-};
+basic.square = function (num) {};
 
 /**
killedBy: numbers square should return the square of a number
statusReason: undefined == 16

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:104:7
  * @return {Number} square of number
  */
 basic.square = function (num) {
-  if (typeof (num) !== 'number') {
+  if (false) {
     throw new Error('Input must be a number.');
   } else {
killedBy: numbers square should throw an Error when input is other than a number
statusReason: Missing expected exception.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:104:7
  * @return {Number} square of number
  */
 basic.square = function (num) {
-  if (typeof (num) !== 'number') {
+  if (typeof num === 'number') {
     throw new Error('Input must be a number.');
   } else {
killedBy: numbers square should return the square of a number
statusReason: Input must be a number.

[Killed] StringLiteral
numbers.js/lib/numbers/basic.js:105:21
  */
 basic.square = function (num) {
   if (typeof (num) !== 'number') {
-    throw new Error('Input must be a number.');
+    throw new Error("");
   } else {
     return num * num;
killedBy: numbers square should throw an Error when input is other than a number
statusReason: The input did not match the regular expression /Input must be a number/. Input:

'Error'

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:106:10
 basic.square = function (num) {
   if (typeof (num) !== 'number') {
     throw new Error('Input must be a number.');
-  } else {
-    return num * num;
-  }
+  } else {}
 
 };
killedBy: numbers square should return the square of a number
statusReason: undefined == 16

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:107:12
   if (typeof (num) !== 'number') {
     throw new Error('Input must be a number.');
   } else {
-    return num * num;
+    return num / num;
   }
 
killedBy: numbers square should return the square of a number
statusReason: 1 == 16

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:119:34
  * @param {Number} number chosen
  * @return {Number} number of possible choices
  */
-basic.binomial = function (n, k) {
-
-  var arr = [];
-
-  function _binomial(n, k) {
-    if (typeof (n) !== 'number' && typeof (k) !== 'number') {
-      throw new Error('Input must be a number.');
-    }
-    if (n >= 0 && k === 0) return 1;
-    if (n === 0 && k > 0) return 0;
-    if (arr[n] && arr[n][k] > 0) return arr[n][k];
-    if (!arr[n]) arr[n] = [];
-
-    arr[n][k] = _binomial(n - 1, k - 1) + _binomial(n - 1, k);
-    return arr[n][k];
-  }
-
-  return _binomial(n, k);
-};
+basic.binomial = function (n, k) {};
 
 /**
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: undefined == 10

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:123:28
 
   var arr = [];
 
-  function _binomial(n, k) {
-    if (typeof (n) !== 'number' && typeof (k) !== 'number') {
-      throw new Error('Input must be a number.');
-    }
-    if (n >= 0 && k === 0) return 1;
-    if (n === 0 && k > 0) return 0;
-    if (arr[n] && arr[n][k] > 0) return arr[n][k];
-    if (!arr[n]) arr[n] = [];
-
-    arr[n][k] = _binomial(n - 1, k - 1) + _binomial(n - 1, k);
-    return arr[n][k];
-  }
+  function _binomial(n, k) {}
 
   return _binomial(n, k);
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: undefined == 10

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:124:36
   var arr = [];
 
   function _binomial(n, k) {
-    if (typeof (n) !== 'number' && typeof (k) !== 'number') {
+    if (typeof (n) !== 'number' && false) {
       throw new Error('Input must be a number.');
     }
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: The input did not match the regular expression /Input must be a number/. Input:

'RangeError: Maximum call stack size exceeded'

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:124:61
   var arr = [];
 
   function _binomial(n, k) {
-    if (typeof (n) !== 'number' && typeof (k) !== 'number') {
-      throw new Error('Input must be a number.');
-    }
+    if (typeof (n) !== 'number' && typeof (k) !== 'number') {}
     if (n >= 0 && k === 0) return 1;
     if (n === 0 && k > 0) return 0;
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: The input did not match the regular expression /Input must be a number/. Input:

'RangeError: Maximum call stack size exceeded'

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:127:9
     if (typeof (n) !== 'number' && typeof (k) !== 'number') {
       throw new Error('Input must be a number.');
     }
-    if (n >= 0 && k === 0) return 1;
+    if (true) return 1;
     if (n === 0 && k > 0) return 0;
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: 1 == 10

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:127:19
     if (typeof (n) !== 'number' && typeof (k) !== 'number') {
       throw new Error('Input must be a number.');
     }
-    if (n >= 0 && k === 0) return 1;
+    if (n >= 0 && false) return 1;
     if (n === 0 && k > 0) return 0;
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: Maximum call stack size exceeded

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:128:20
       throw new Error('Input must be a number.');
     }
     if (n >= 0 && k === 0) return 1;
-    if (n === 0 && k > 0) return 0;
+    if (n === 0 && k <= 0) return 0;
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
     if (!arr[n]) arr[n] = [];
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: Maximum call stack size exceeded

[Killed] LogicalOperator
numbers.js/lib/numbers/basic.js:128:9
       throw new Error('Input must be a number.');
     }
     if (n >= 0 && k === 0) return 1;
-    if (n === 0 && k > 0) return 0;
+    if (n === 0 || k > 0) return 0;
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
     if (!arr[n]) arr[n] = [];
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: 0 == 10

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:129:9
     }
     if (n >= 0 && k === 0) return 1;
     if (n === 0 && k > 0) return 0;
-    if (arr[n] && arr[n][k] > 0) return arr[n][k];
+    if (true) return arr[n][k];
     if (!arr[n]) arr[n] = [];
 
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: Cannot read property '3' of undefined

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:129:19
     }
     if (n >= 0 && k === 0) return 1;
     if (n === 0 && k > 0) return 0;
-    if (arr[n] && arr[n][k] > 0) return arr[n][k];
+    if (arr[n] && true) return arr[n][k];
     if (!arr[n]) arr[n] = [];
 
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: NaN == 10

[Killed] BooleanLiteral
numbers.js/lib/numbers/basic.js:130:9
     if (n >= 0 && k === 0) return 1;
     if (n === 0 && k > 0) return 0;
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
-    if (!arr[n]) arr[n] = [];
+    if (arr[n]) arr[n] = [];
 
     arr[n][k] = _binomial(n - 1, k - 1) + _binomial(n - 1, k);
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: Cannot set property '1' of undefined

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:130:9
     if (n >= 0 && k === 0) return 1;
     if (n === 0 && k > 0) return 0;
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
-    if (!arr[n]) arr[n] = [];
+    if (false) arr[n] = [];
 
     arr[n][k] = _binomial(n - 1, k - 1) + _binomial(n - 1, k);
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: Cannot set property '1' of undefined

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:132:34
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
     if (!arr[n]) arr[n] = [];
 
-    arr[n][k] = _binomial(n - 1, k - 1) + _binomial(n - 1, k);
+    arr[n][k] = _binomial(n - 1, k + 1) + _binomial(n - 1, k);
     return arr[n][k];
   }
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: 0 == 10

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:132:27
     if (arr[n] && arr[n][k] > 0) return arr[n][k];
     if (!arr[n]) arr[n] = [];
 
-    arr[n][k] = _binomial(n - 1, k - 1) + _binomial(n - 1, k);
+    arr[n][k] = _binomial(n + 1, k - 1) + _binomial(n - 1, k);
     return arr[n][k];
   }
killedBy: numbers binomial should return the binomial coefficient (n choose k) of two numbers
statusReason: 75 == 10

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:145:34
  * @param {Number} integer.
  * @return {Number} result.
  */
-basic.factorial = function (num) {
-  if (typeof (num) !== 'number') throw new Error("Input must be a number.");
-  if (num < 0) throw new Error("Input must not be negative.");
-  var i = 2,
-    o = 1;
-
-  while (i <= num) {
-    o *= i++;
-  }
-
-  return o;
-};
+basic.factorial = function (num) {};
 
 /**
killedBy: numbers factorial should return the product of n * (n - 1) * (n - 2) * ... * 1
statusReason: undefined == 24

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:146:7
  * @return {Number} result.
  */
 basic.factorial = function (num) {
-  if (typeof (num) !== 'number') throw new Error("Input must be a number.");
+  if (false) throw new Error("Input must be a number.");
   if (num < 0) throw new Error("Input must not be negative.");
   var i = 2,
killedBy: numbers factorial should return the product of n * (n - 1) * (n - 2) * ... * 1
statusReason: /Input must not be negative/

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:146:7
  * @return {Number} result.
  */
 basic.factorial = function (num) {
-  if (typeof (num) !== 'number') throw new Error("Input must be a number.");
+  if (true) throw new Error("Input must be a number.");
   if (num < 0) throw new Error("Input must not be negative.");
   var i = 2,
killedBy: numbers factorial should return the product of n * (n - 1) * (n - 2) * ... * 1
statusReason: Input must be a number.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:147:7
  */
 basic.factorial = function (num) {
   if (typeof (num) !== 'number') throw new Error("Input must be a number.");
-  if (num < 0) throw new Error("Input must not be negative.");
+  if (num >= 0) throw new Error("Input must not be negative.");
   var i = 2,
     o = 1;
killedBy: numbers factorial should return the product of n * (n - 1) * (n - 2) * ... * 1
statusReason: Input must not be negative.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:147:7
  */
 basic.factorial = function (num) {
   if (typeof (num) !== 'number') throw new Error("Input must be a number.");
-  if (num < 0) throw new Error("Input must not be negative.");
+  if (num <= 0) throw new Error("Input must not be negative.");
   var i = 2,
     o = 1;
killedBy: numbers permutation should return the permutation coefficient (n permute k) of two numbers
statusReason: Input must not be negative.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:151:10
   var i = 2,
     o = 1;
 
-  while (i <= num) {
+  while (i < num) {
     o *= i++;
   }
killedBy: numbers factorial should return the product of n * (n - 1) * (n - 2) * ... * 1
statusReason: 6 == 24

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:151:10
   var i = 2,
     o = 1;
 
-  while (i <= num) {
+  while (i > num) {
     o *= i++;
   }
killedBy: numbers factorial should return the product of n * (n - 1) * (n - 2) * ... * 1
statusReason: 1 == 24

[Timeout] UpdateOperator
numbers.js/lib/numbers/basic.js:152:10
     o = 1;
 
   while (i <= num) {
-    o *= i++;
+    o *= i--;
   }
 

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:165:29
  * @param {Number} number B.
  * @return {Number} greatest common divisor for integers A, B.
  */
-basic.gcd = function (a, b) {
-  var c;
-  a = +a;
-  b = +b;
-  // Same as isNaN() but faster
-  if (a !== a || b !== b) {
-    return NaN;
-  }
-  //Same as !isFinite() but faster
-  if (a === Infinity || a === -Infinity || b === Infinity || b === -Infinity) {
-    return Infinity;
-  }
-  // Checks if a or b are decimals
-  if ((a % 1 !== 0) || (b % 1 !== 0)) {
-    throw new Error("Can only operate on integers");
-  }
-  while (b) {
-    c = a % b;
-    a = b;
-    b = c;
-  }
-  return (0 < a) ? a : -a;
-};
+basic.gcd = function (a, b) {};
 
 /**
killedBy: numbers gcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Survived] UnaryOperator
numbers.js/lib/numbers/basic.js:167:7
  */
 basic.gcd = function (a, b) {
   var c;
-  a = +a;
+  a = -a;
   b = +b;
   // Same as isNaN() but faster

[Survived] UnaryOperator
numbers.js/lib/numbers/basic.js:168:7
 basic.gcd = function (a, b) {
   var c;
   a = +a;
-  b = +b;
+  b = -b;
   // Same as isNaN() but faster
   if (a !== a || b !== b) {

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:170:18
   a = +a;
   b = +b;
   // Same as isNaN() but faster
-  if (a !== a || b !== b) {
+  if (a !== a || true) {
     return NaN;
   }
killedBy: numbers gcd should throw an exception when given a decimal
statusReason: Missing expected exception.
