[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:170:18
   a = +a;
   b = +b;
   // Same as isNaN() but faster
-  if (a !== a || b !== b) {
+  if (a !== a || b === b) {
     return NaN;
   }
killedBy: numbers gcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:174:44
     return NaN;
   }
   //Same as !isFinite() but faster
-  if (a === Infinity || a === -Infinity || b === Infinity || b === -Infinity) {
+  if (a === Infinity || a === -Infinity || false || b === -Infinity) {
     return Infinity;
   }
killedBy: numbers lcm should return the least common multiple of two integers
statusReason: Can only operate on integers

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:174:62
     return NaN;
   }
   //Same as !isFinite() but faster
-  if (a === Infinity || a === -Infinity || b === Infinity || b === -Infinity) {
+  if (a === Infinity || a === -Infinity || b === Infinity || b !== -Infinity) {
     return Infinity;
   }
killedBy: numbers gcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:178:8
     return Infinity;
   }
   // Checks if a or b are decimals
-  if ((a % 1 !== 0) || (b % 1 !== 0)) {
+  if ((true) || (b % 1 !== 0)) {
     throw new Error("Can only operate on integers");
   }
killedBy: numbers gcd should return the greatest common denominator of two integers
statusReason: Can only operate on integers

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:178:39
     return Infinity;
   }
   // Checks if a or b are decimals
-  if ((a % 1 !== 0) || (b % 1 !== 0)) {
-    throw new Error("Can only operate on integers");
-  }
+  if ((a % 1 !== 0) || (b % 1 !== 0)) {}
   while (b) {
     c = a % b;
killedBy: numbers gcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:181:10
   if ((a % 1 !== 0) || (b % 1 !== 0)) {
     throw new Error("Can only operate on integers");
   }
-  while (b) {
+  while (false) {
     c = a % b;
     a = b;
killedBy: numbers gcd should return the greatest common denominator of two integers
statusReason: -0 == 5298

[Timeout] BlockStatement
numbers.js/lib/numbers/basic.js:181:13
   if ((a % 1 !== 0) || (b % 1 !== 0)) {
     throw new Error("Can only operate on integers");
   }
-  while (b) {
-    c = a % b;
-    a = b;
-    b = c;
-  }
+  while (b) {}
   return (0 < a) ? a : -a;
 };

[Timeout] ArithmeticOperator
numbers.js/lib/numbers/basic.js:182:9
     throw new Error("Can only operate on integers");
   }
   while (b) {
-    c = a % b;
+    c = a * b;
     a = b;
     b = c;

[Killed] UnaryOperator
numbers.js/lib/numbers/basic.js:186:24
     a = b;
     b = c;
   }
-  return (0 < a) ? a : -a;
+  return (0 < a) ? a : +a;
 };
 
killedBy: numbers gcd should return the greatest common denominator of two integers
statusReason: -5298 == 5298

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:186:11
     a = b;
     b = c;
   }
-  return (0 < a) ? a : -a;
+  return (true) ? a : -a;
 };
 
killedBy: numbers gcd should return the greatest common denominator of two integers
statusReason: -5298 == 5298

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:196:35
  * @param {Number} number B.
  * @return {Number} least common multiple for integers A, B.
  */
-basic.lcm = function (num1, num2) {
-  return Math.abs(num1 * num2) / basic.gcd(num1, num2);
-};
+basic.lcm = function (num1, num2) {};
 
 /**
killedBy: numbers lcm should return the least common multiple of two integers
statusReason: undefined == 0

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:197:19
  * @return {Number} least common multiple for integers A, B.
  */
 basic.lcm = function (num1, num2) {
-  return Math.abs(num1 * num2) / basic.gcd(num1, num2);
+  return Math.abs(num1 / num2) / basic.gcd(num1, num2);
 };
 
killedBy: numbers lcm should return the least common multiple of two integers
statusReason: Infinity == 0

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:197:10
  * @return {Number} least common multiple for integers A, B.
  */
 basic.lcm = function (num1, num2) {
-  return Math.abs(num1 * num2) / basic.gcd(num1, num2);
+  return Math.abs(num1 * num2) * basic.gcd(num1, num2);
 };
 
killedBy: numbers lcm should return the least common multiple of two integers
statusReason: false == true

[NoCoverage] BlockStatement
numbers.js/lib/numbers/basic.js:208:55
  * @param {Boolean} allow the same number to be returned twice.
  * @return {Array} random elements.
  */
-basic.random = function (arr, quant, allowDuplicates) {
-  if (arr.length === 0) {
-    throw new Error('Empty array');
-  } else if (quant > arr.length && !allowDuplicates) {
-    throw new Error('Quantity requested exceeds size of array');
-  }
-
-  if (allowDuplicates === true) {
-    var result = [],
-      i;
-    for (i = 0; i < quant; i++) {
-      result[i] = arr[Math.floor(Math.random() * arr.length)];
-    }
-    return result;
-  } else {
-    return basic.shuffle(arr).slice(0, quant);
-  }
-};
+basic.random = function (arr, quant, allowDuplicates) {};
 
 /**

[NoCoverage] EqualityOperator
numbers.js/lib/numbers/basic.js:209:7
  * @return {Array} random elements.
  */
 basic.random = function (arr, quant, allowDuplicates) {
-  if (arr.length === 0) {
+  if (arr.length !== 0) {
     throw new Error('Empty array');
   } else if (quant > arr.length && !allowDuplicates) {

[NoCoverage] BlockStatement
numbers.js/lib/numbers/basic.js:209:25
  * @return {Array} random elements.
  */
 basic.random = function (arr, quant, allowDuplicates) {
-  if (arr.length === 0) {
-    throw new Error('Empty array');
-  } else if (quant > arr.length && !allowDuplicates) {
+  if (arr.length === 0) {} else if (quant > arr.length && !allowDuplicates) {
     throw new Error('Quantity requested exceeds size of array');
   }

[NoCoverage] BlockStatement
numbers.js/lib/numbers/basic.js:211:54
 basic.random = function (arr, quant, allowDuplicates) {
   if (arr.length === 0) {
     throw new Error('Empty array');
-  } else if (quant > arr.length && !allowDuplicates) {
-    throw new Error('Quantity requested exceeds size of array');
-  }
+  } else if (quant > arr.length && !allowDuplicates) {}
 
   if (allowDuplicates === true) {

[NoCoverage] ConditionalExpression
numbers.js/lib/numbers/basic.js:211:14
 basic.random = function (arr, quant, allowDuplicates) {
   if (arr.length === 0) {
     throw new Error('Empty array');
-  } else if (quant > arr.length && !allowDuplicates) {
+  } else if (true) {
     throw new Error('Quantity requested exceeds size of array');
   }

[NoCoverage] BooleanLiteral
numbers.js/lib/numbers/basic.js:215:27
     throw new Error('Quantity requested exceeds size of array');
   }
 
-  if (allowDuplicates === true) {
+  if (allowDuplicates === false) {
     var result = [],
       i;

[NoCoverage] ConditionalExpression
numbers.js/lib/numbers/basic.js:215:7
     throw new Error('Quantity requested exceeds size of array');
   }
 
-  if (allowDuplicates === true) {
+  if (false) {
     var result = [],
       i;

[NoCoverage] BlockStatement
numbers.js/lib/numbers/basic.js:218:33
   if (allowDuplicates === true) {
     var result = [],
       i;
-    for (i = 0; i < quant; i++) {
-      result[i] = arr[Math.floor(Math.random() * arr.length)];
-    }
+    for (i = 0; i < quant; i++) {}
     return result;
   } else {

[NoCoverage] EqualityOperator
numbers.js/lib/numbers/basic.js:218:17
   if (allowDuplicates === true) {
     var result = [],
       i;
-    for (i = 0; i < quant; i++) {
+    for (i = 0; i >= quant; i++) {
       result[i] = arr[Math.floor(Math.random() * arr.length)];
     }

[NoCoverage] ArithmeticOperator
numbers.js/lib/numbers/basic.js:219:34
     var result = [],
       i;
     for (i = 0; i < quant; i++) {
-      result[i] = arr[Math.floor(Math.random() * arr.length)];
+      result[i] = arr[Math.floor(Math.random() / arr.length)];
     }
     return result;

[NoCoverage] BlockStatement
numbers.js/lib/numbers/basic.js:222:10
       result[i] = arr[Math.floor(Math.random() * arr.length)];
     }
     return result;
-  } else {
-    return basic.shuffle(arr).slice(0, quant);
-  }
+  } else {}
 };
 

[NoCoverage] BlockStatement
numbers.js/lib/numbers/basic.js:233:34
  * @param {Array} array to be shuffled.
  * @return {Array} shuffled array.
  */
-basic.shuffle = function (array) {
-  var m = array.length,
-    t, i;
-
-  while (m) {
-    i = Math.floor(Math.random() * m--);
-
-    t = array[m];
-    array[m] = array[i];
-    array[i] = t;
-  }
-
-  return array;
-};
+basic.shuffle = function (array) {};
 
 /**

[NoCoverage] ConditionalExpression
numbers.js/lib/numbers/basic.js:237:10
   var m = array.length,
     t, i;
 
-  while (m) {
+  while (false) {
     i = Math.floor(Math.random() * m--);
 

[NoCoverage] BlockStatement
numbers.js/lib/numbers/basic.js:237:13
   var m = array.length,
     t, i;
 
-  while (m) {
-    i = Math.floor(Math.random() * m--);
-
-    t = array[m];
-    array[m] = array[i];
-    array[i] = t;
-  }
+  while (m) {}
 
   return array;

[NoCoverage] ArithmeticOperator
numbers.js/lib/numbers/basic.js:238:20
     t, i;
 
   while (m) {
-    i = Math.floor(Math.random() * m--);
+    i = Math.floor(Math.random() / m--);
 
     t = array[m];

[NoCoverage] UpdateOperator
numbers.js/lib/numbers/basic.js:238:36
     t, i;
 
   while (m) {
-    i = Math.floor(Math.random() * m--);
+    i = Math.floor(Math.random() * m++);
 
     t = array[m];

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:254:28
  * @param {Array} array to be traversed.
  * @return {Number} maximum value in the array.
  */
-basic.max = function (arr) {
-  if (!Array.isArray(arr)) {
-    throw new Error("Input must be of type Array");
-  }
-  var max = -Infinity,
-    val;
-  for (var i = 0, len = arr.length; i < len; i++) {
-    val = +arr[i];
-    if (max < val) {
-      max = val;
-    }
-    // Math.max() returns NaN if one of the elements is not a number.
-    if (val !== val) {
-      return NaN;
-    }
-  }
-  return max;
-};
+basic.max = function (arr) {};
 
 /**
killedBy: numbers basic.max will throw an exception if argument is not an array.
statusReason: Missing expected exception.

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:255:28
  * @return {Number} maximum value in the array.
  */
 basic.max = function (arr) {
-  if (!Array.isArray(arr)) {
-    throw new Error("Input must be of type Array");
-  }
+  if (!Array.isArray(arr)) {}
   var max = -Infinity,
     val;
killedBy: numbers basic.max will throw an exception if argument is not an array.
statusReason: Missing expected exception.

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:255:7
  * @return {Number} maximum value in the array.
  */
 basic.max = function (arr) {
-  if (!Array.isArray(arr)) {
+  if (true) {
     throw new Error("Input must be of type Array");
   }
killedBy: numbers max should return the biggest number in an array
statusReason: Input must be of type Array

[Killed] UnaryOperator
numbers.js/lib/numbers/basic.js:258:13
   if (!Array.isArray(arr)) {
     throw new Error("Input must be of type Array");
   }
-  var max = -Infinity,
+  var max = +Infinity,
     val;
   for (var i = 0, len = arr.length; i < len; i++) {
killedBy: numbers max should return the biggest number in an array
statusReason: Infinity == 42

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:260:37
   }
   var max = -Infinity,
     val;
-  for (var i = 0, len = arr.length; i < len; i++) {
+  for (var i = 0, len = arr.length; i >= len; i++) {
     val = +arr[i];
     if (max < val) {
killedBy: numbers max should return the biggest number in an array
statusReason: -Infinity == 42

[Killed] UpdateOperator
numbers.js/lib/numbers/basic.js:260:46
   }
   var max = -Infinity,
     val;
-  for (var i = 0, len = arr.length; i < len; i++) {
+  for (var i = 0, len = arr.length; i < len; i--) {
     val = +arr[i];
     if (max < val) {
killedBy: numbers max should return the biggest number in an array
statusReason: NaN == 42

[Killed] UnaryOperator
numbers.js/lib/numbers/basic.js:261:11
   var max = -Infinity,
     val;
   for (var i = 0, len = arr.length; i < len; i++) {
-    val = +arr[i];
+    val = -arr[i];
     if (max < val) {
       max = val;
killedBy: numbers max should return the biggest number in an array
statusReason: -1 == 42

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:262:9
     val;
   for (var i = 0, len = arr.length; i < len; i++) {
     val = +arr[i];
-    if (max < val) {
+    if (true) {
       max = val;
     }
killedBy: numbers max should return the biggest number in an array
statusReason: -42 == -1

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:262:20
     val;
   for (var i = 0, len = arr.length; i < len; i++) {
     val = +arr[i];
-    if (max < val) {
-      max = val;
-    }
+    if (max < val) {}
     // Math.max() returns NaN if one of the elements is not a number.
     if (val !== val) {
killedBy: numbers max should return the biggest number in an array
statusReason: -Infinity == 42

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:266:9
       max = val;
     }
     // Math.max() returns NaN if one of the elements is not a number.
-    if (val !== val) {
+    if (true) {
       return NaN;
     }
killedBy: numbers max should return the biggest number in an array
statusReason: NaN == 42

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:266:9
       max = val;
     }
     // Math.max() returns NaN if one of the elements is not a number.
-    if (val !== val) {
+    if (val === val) {
       return NaN;
     }
killedBy: numbers max should return the biggest number in an array
statusReason: NaN == 42

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:279:28
  * @param {Array} array to be traversed.
  * @return {Number} minimum value in the array.
  */
-basic.min = function (arr) {
-  if (!Array.isArray(arr)) {
-    throw new Error("Input must be of type Array");
-  }
-  var min = +Infinity,
-    val;
-  for (var i = 0, len = arr.length; i < len; i++) {
-    val = +arr[i];
-    if (val < min) {
-      min = val;
-    }
-    // Math.min() returns NaN if one of the elements is not a number.
-    if (val !== val) {
-      return NaN;
-    }
-  }
-  return min;
-};
+basic.min = function (arr) {};
 
 
killedBy: numbers basic.min will throw an exception if argument is not an array.
statusReason: Missing expected exception.

[Killed] BooleanLiteral
numbers.js/lib/numbers/basic.js:280:7
  * @return {Number} minimum value in the array.
  */
 basic.min = function (arr) {
-  if (!Array.isArray(arr)) {
+  if (Array.isArray(arr)) {
     throw new Error("Input must be of type Array");
   }
killedBy: numbers basic.min will throw an exception if argument is not an array.
statusReason: Missing expected exception.

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:280:28
  * @return {Number} minimum value in the array.
  */
 basic.min = function (arr) {
-  if (!Array.isArray(arr)) {
-    throw new Error("Input must be of type Array");
-  }
+  if (!Array.isArray(arr)) {}
   var min = +Infinity,
     val;
killedBy: numbers basic.min will throw an exception if argument is not an array.
statusReason: Missing expected exception.

[Killed] UnaryOperator
numbers.js/lib/numbers/basic.js:283:13
   if (!Array.isArray(arr)) {
     throw new Error("Input must be of type Array");
   }
-  var min = +Infinity,
+  var min = -Infinity,
     val;
   for (var i = 0, len = arr.length; i < len; i++) {
killedBy: numbers min should return the smallest number in an array
statusReason: -Infinity == 1

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:285:51
   }
   var min = +Infinity,
     val;
-  for (var i = 0, len = arr.length; i < len; i++) {
-    val = +arr[i];
-    if (val < min) {
-      min = val;
-    }
-    // Math.min() returns NaN if one of the elements is not a number.
-    if (val !== val) {
-      return NaN;
-    }
-  }
+  for (var i = 0, len = arr.length; i < len; i++) {}
   return min;
 };
killedBy: numbers min should return the smallest number in an array
statusReason: Infinity == 1

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:285:37
   }
   var min = +Infinity,
     val;
-  for (var i = 0, len = arr.length; i < len; i++) {
+  for (var i = 0, len = arr.length; false; i++) {
     val = +arr[i];
     if (val < min) {
killedBy: numbers min should return the smallest number in an array
statusReason: Infinity == 1

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:287:9
     val;
   for (var i = 0, len = arr.length; i < len; i++) {
     val = +arr[i];
-    if (val < min) {
+    if (val >= min) {
       min = val;
     }
killedBy: numbers min should return the smallest number in an array
statusReason: Infinity == 1

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:287:9
     val;
   for (var i = 0, len = arr.length; i < len; i++) {
     val = +arr[i];
-    if (val < min) {
+    if (false) {
       min = val;
     }
killedBy: numbers min should return the smallest number in an array
statusReason: Infinity == 1

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:291:9
       min = val;
     }
     // Math.min() returns NaN if one of the elements is not a number.
-    if (val !== val) {
+    if (true) {
       return NaN;
     }
killedBy: numbers min should return the smallest number in an array
statusReason: NaN == 1

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:291:9
       min = val;
     }
     // Math.min() returns NaN if one of the elements is not a number.
-    if (val !== val) {
+    if (val === val) {
       return NaN;
     }
killedBy: numbers min should return the smallest number in an array
statusReason: NaN == 1

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:310:7
   var array, i = 0,
     len;
 
-  if (arguments.length <= 1) {
+  if (true) {
     stop = start || 0;
     start = 0;
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[
  0,
  1
]

should loosely deep-equal

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:310:7
   var array, i = 0,
     len;
 
-  if (arguments.length <= 1) {
+  if (arguments.length > 1) {
     stop = start || 0;
     start = 0;
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[
  0,
  1
]

should loosely deep-equal

[NoCoverage] LogicalOperator
numbers.js/lib/numbers/basic.js:311:12
     len;
 
   if (arguments.length <= 1) {
-    stop = start || 0;
+    stop = start && 0;
     start = 0;
   }

[NoCoverage] ConditionalExpression
numbers.js/lib/numbers/basic.js:311:12
     len;
 
   if (arguments.length <= 1) {
-    stop = start || 0;
+    stop = false;
     start = 0;
   }

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:315:10
     start = 0;
   }
 
-  step = step || 1;
+  step = false;
 
   if (stop < start) {
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Invalid array length

[Killed] LogicalOperator
numbers.js/lib/numbers/basic.js:315:10
     start = 0;
   }
 
-  step = step || 1;
+  step = step && 1;
 
   if (stop < start) {
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Invalid array length

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:317:7
 
   step = step || 1;
 
-  if (stop < start) {
+  if (stop >= start) {
     step = 0 - Math.abs(step);
   }
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[]

should loosely deep-equal

[
  1,

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:317:21
 
   step = step || 1;
 
-  if (stop < start) {
-    step = 0 - Math.abs(step);
-  }
+  if (stop < start) {}
 
   len = Math.max(Math.ceil((stop - start) / step) + 1, 0);
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[]

should loosely deep-equal

[
  10,

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:318:12
   step = step || 1;
 
   if (stop < start) {
-    step = 0 - Math.abs(step);
+    step = 0 + Math.abs(step);
   }
 
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[]

should loosely deep-equal

[
  10,

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:321:29
     step = 0 - Math.abs(step);
   }
 
-  len = Math.max(Math.ceil((stop - start) / step) + 1, 0);
+  len = Math.max(Math.ceil((stop + start) / step) + 1, 0);
 
   array = new Array(len);
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[
  1,
  2,
  3,
  4,
  5,

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:321:18
     step = 0 - Math.abs(step);
   }
 
-  len = Math.max(Math.ceil((stop - start) / step) + 1, 0);
+  len = Math.max(Math.ceil((stop - start) / step) - 1, 0);
 
   array = new Array(len);
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[
  1,
  2,
  3,
  4,
  5,

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:325:10
 
   array = new Array(len);
 
-  while (i < len) {
+  while (false) {
     array[i++] = start;
     start += step;
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[
  <10 empty items>
]

should loosely deep-equal

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:325:10
 
   array = new Array(len);
 
-  while (i < len) {
+  while (i <= len) {
     array[i++] = start;
     start += step;
killedBy: numbers range should return an appropriate range for the given start, stop, and step parameters
statusReason: Expected values to be loosely deep-equal:

[
  1,
  2,
  3,
  4,
  5,

[Timeout] UpdateOperator
numbers.js/lib/numbers/basic.js:326:11
   array = new Array(len);
 
   while (i < len) {
-    array[i++] = start;
+    array[i--] = start;
     start += step;
   }

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:339:28
  * @param {Number} the number
  * @return {Boolean} true for int, false for not int.
  */
-basic.isInt = function (n) {
-  return n % 1 === 0;
-};
+basic.isInt = function (n) {};
 
 /**
killedBy: numbers isInt checks for an integer
statusReason: undefined == false

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:340:10
  * @return {Boolean} true for int, false for not int.
  */
 basic.isInt = function (n) {
-  return n % 1 === 0;
+  return true;
 };
 
killedBy: numbers isInt checks for an integer
statusReason: true == false

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:340:10
  * @return {Boolean} true for int, false for not int.
  */
 basic.isInt = function (n) {
-  return n % 1 === 0;
+  return n % 1 !== 0;
 };
 
killedBy: numbers isInt checks for an integer
statusReason: true == false

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:350:32
  * @param {Number} int b.
  * @return {Array} [div, mod].
  */
-basic.divMod = function (a, b) {
-  if (b <= 0) throw new Error("b cannot be zero. Undefined.");
-  if (!basic.isInt(a) || !basic.isInt(b)) throw new Error("A or B are not integers.");
-  return [Math.floor(a / b), a % b];
-};
+basic.divMod = function (a, b) {};
 
 /**
killedBy: numbers divMod should return an array of both the division and modulus values of two integers
statusReason: Expected values to be loosely deep-equal:

undefined

should loosely deep-equal

[
  2,

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:351:7
  * @return {Array} [div, mod].
  */
 basic.divMod = function (a, b) {
-  if (b <= 0) throw new Error("b cannot be zero. Undefined.");
+  if (true) throw new Error("b cannot be zero. Undefined.");
   if (!basic.isInt(a) || !basic.isInt(b)) throw new Error("A or B are not integers.");
   return [Math.floor(a / b), a % b];
killedBy: numbers divMod should return an array of both the division and modulus values of two integers
statusReason: b cannot be zero. Undefined.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:351:7
  * @return {Array} [div, mod].
  */
 basic.divMod = function (a, b) {
-  if (b <= 0) throw new Error("b cannot be zero. Undefined.");
+  if (b > 0) throw new Error("b cannot be zero. Undefined.");
   if (!basic.isInt(a) || !basic.isInt(b)) throw new Error("A or B are not integers.");
   return [Math.floor(a / b), a % b];
killedBy: numbers divMod should return an array of both the division and modulus values of two integers
statusReason: b cannot be zero. Undefined.

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:352:7
  */
 basic.divMod = function (a, b) {
   if (b <= 0) throw new Error("b cannot be zero. Undefined.");
-  if (!basic.isInt(a) || !basic.isInt(b)) throw new Error("A or B are not integers.");
+  if (true) throw new Error("A or B are not integers.");
   return [Math.floor(a / b), a % b];
 };
killedBy: numbers divMod should return an array of both the division and modulus values of two integers
statusReason: A or B are not integers.

[Killed] BooleanLiteral
numbers.js/lib/numbers/basic.js:352:7
  */
 basic.divMod = function (a, b) {
   if (b <= 0) throw new Error("b cannot be zero. Undefined.");
-  if (!basic.isInt(a) || !basic.isInt(b)) throw new Error("A or B are not integers.");
+  if (basic.isInt(a) || !basic.isInt(b)) throw new Error("A or B are not integers.");
   return [Math.floor(a / b), a % b];
 };
killedBy: numbers divMod should return an array of both the division and modulus values of two integers
statusReason: A or B are not integers.

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:353:30
 basic.divMod = function (a, b) {
   if (b <= 0) throw new Error("b cannot be zero. Undefined.");
   if (!basic.isInt(a) || !basic.isInt(b)) throw new Error("A or B are not integers.");
-  return [Math.floor(a / b), a % b];
+  return [Math.floor(a / b), a * b];
 };
 
killedBy: numbers divMod should return an array of both the division and modulus values of two integers
statusReason: Expected values to be loosely deep-equal:

[
  2,
  72
]

should loosely deep-equal

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:353:22
 basic.divMod = function (a, b) {
   if (b <= 0) throw new Error("b cannot be zero. Undefined.");
   if (!basic.isInt(a) || !basic.isInt(b)) throw new Error("A or B are not integers.");
-  return [Math.floor(a / b), a % b];
+  return [Math.floor(a * b), a % b];
 };
 
killedBy: numbers divMod should return an array of both the division and modulus values of two integers
statusReason: Expected values to be loosely deep-equal:

[
  72,
  0
]

should loosely deep-equal

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:367:37
  * @param {Number} Modulo m.
  * @return {Number} see the above documentation for return values.
  */
-basic.powerMod = function (a, b, m) {
-  if (typeof (a) !== 'number' || typeof (b) !== 'number' || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
-  // If b < -1 should be a small number, this method should work for now.
-  if (b < -1) return Math.pow(a, b) % m;
-  if (b === 0) return 1 % m;
-  if (b >= 1) {
-    var result = 1;
-    while (b > 0) {
-      if ((b % 2) === 1) {
-        result = (result * a) % m;
-      }
-
-      a = (a * a) % m;
-      b = b >> 1;
-    }
-    return result;
-  }
-
-  if (b === -1) return basic.modInverse(a, m);
-  if (b < 1) {
-    return basic.powerMod(a, Math.pow(b, -1), m);
-  }
-};
+basic.powerMod = function (a, b, m) {};
 
 /**
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: undefined == 1

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:368:34
  * @return {Number} see the above documentation for return values.
  */
 basic.powerMod = function (a, b, m) {
-  if (typeof (a) !== 'number' || typeof (b) !== 'number' || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
+  if (typeof (a) !== 'number' || true || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
   // If b < -1 should be a small number, this method should work for now.
   if (b < -1) return Math.pow(a, b) % m;
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: Inputs must be numbers.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:368:61
  * @return {Number} see the above documentation for return values.
  */
 basic.powerMod = function (a, b, m) {
-  if (typeof (a) !== 'number' || typeof (b) !== 'number' || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
+  if (typeof (a) !== 'number' || typeof (b) !== 'number' || typeof m === 'number') throw new Error("Inputs must be numbers.");
   // If b < -1 should be a small number, this method should work for now.
   if (b < -1) return Math.pow(a, b) % m;
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: Inputs must be numbers.
