[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:370:7
 basic.powerMod = function (a, b, m) {
   if (typeof (a) !== 'number' || typeof (b) !== 'number' || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
   // If b < -1 should be a small number, this method should work for now.
-  if (b < -1) return Math.pow(a, b) % m;
+  if (b >= -1) return Math.pow(a, b) % m;
   if (b === 0) return 1 % m;
   if (b >= 1) {
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: NaN == 16

[Killed] UnaryOperator
numbers.js/lib/numbers/basic.js:370:11
 basic.powerMod = function (a, b, m) {
   if (typeof (a) !== 'number' || typeof (b) !== 'number' || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
   // If b < -1 should be a small number, this method should work for now.
-  if (b < -1) return Math.pow(a, b) % m;
+  if (b < +1) return Math.pow(a, b) % m;
   if (b === 0) return 1 % m;
   if (b >= 1) {
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 2.449489742783178 == 6

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:371:7
   if (typeof (a) !== 'number' || typeof (b) !== 'number' || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
   // If b < -1 should be a small number, this method should work for now.
   if (b < -1) return Math.pow(a, b) % m;
-  if (b === 0) return 1 % m;
+  if (b !== 0) return 1 % m;
   if (b >= 1) {
     var result = 1;
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 1 == 16

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:371:7
   if (typeof (a) !== 'number' || typeof (b) !== 'number' || typeof (m) !== 'number') throw new Error("Inputs must be numbers.");
   // If b < -1 should be a small number, this method should work for now.
   if (b < -1) return Math.pow(a, b) % m;
-  if (b === 0) return 1 % m;
+  if (true) return 1 % m;
   if (b >= 1) {
     var result = 1;
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 1 == 16

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:372:7
   // If b < -1 should be a small number, this method should work for now.
   if (b < -1) return Math.pow(a, b) % m;
   if (b === 0) return 1 % m;
-  if (b >= 1) {
+  if (b < 1) {
     var result = 1;
     while (b > 0) {
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: undefined == 1

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:372:15
   // If b < -1 should be a small number, this method should work for now.
   if (b < -1) return Math.pow(a, b) % m;
   if (b === 0) return 1 % m;
-  if (b >= 1) {
-    var result = 1;
-    while (b > 0) {
-      if ((b % 2) === 1) {
-        result = (result * a) % m;
-      }
-
-      a = (a * a) % m;
-      b = b >> 1;
-    }
-    return result;
-  }
+  if (b >= 1) {}
 
   if (b === -1) return basic.modInverse(a, m);
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: undefined == 1

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:374:12
   if (b === 0) return 1 % m;
   if (b >= 1) {
     var result = 1;
-    while (b > 0) {
+    while (false) {
       if ((b % 2) === 1) {
         result = (result * a) % m;
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 1 == 16

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:374:12
   if (b === 0) return 1 % m;
   if (b >= 1) {
     var result = 1;
-    while (b > 0) {
+    while (b <= 0) {
       if ((b % 2) === 1) {
         result = (result * a) % m;
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 1 == 16

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:375:11
   if (b >= 1) {
     var result = 1;
     while (b > 0) {
-      if ((b % 2) === 1) {
+      if (true) {
         result = (result * a) % m;
       }
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 2 == 1

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:375:12
   if (b >= 1) {
     var result = 1;
     while (b > 0) {
-      if ((b % 2) === 1) {
+      if ((b * 2) === 1) {
         result = (result * a) % m;
       }
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 1 == 16

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:376:19
     var result = 1;
     while (b > 0) {
       if ((b % 2) === 1) {
-        result = (result * a) % m;
+        result = (result / a) % m;
       }
 
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 5.820766091346741e-11 == 16

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:376:18
     var result = 1;
     while (b > 0) {
       if ((b % 2) === 1) {
-        result = (result * a) % m;
+        result = result * a * m;
       }
 
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 9 == 1

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:379:11
         result = (result * a) % m;
       }
 
-      a = (a * a) % m;
+      a = a * a * m;
       b = b >> 1;
     }
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 0 == 1

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:379:12
         result = (result * a) % m;
       }
 
-      a = (a * a) % m;
+      a = (a / a) % m;
       b = b >> 1;
     }
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: 1 == 16

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:385:7
     return result;
   }
 
-  if (b === -1) return basic.modInverse(a, m);
+  if (true) return basic.modInverse(a, m);
   if (b < 1) {
     return basic.powerMod(a, Math.pow(b, -1), m);
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: No modular inverse exists

[Timeout] UnaryOperator
numbers.js/lib/numbers/basic.js:385:13
     return result;
   }
 
-  if (b === -1) return basic.modInverse(a, m);
+  if (b === +1) return basic.modInverse(a, m);
   if (b < 1) {
     return basic.powerMod(a, Math.pow(b, -1), m);

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:386:7
   }
 
   if (b === -1) return basic.modInverse(a, m);
-  if (b < 1) {
+  if (false) {
     return basic.powerMod(a, Math.pow(b, -1), m);
   }
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: undefined == 6

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:386:14
   }
 
   if (b === -1) return basic.modInverse(a, m);
-  if (b < 1) {
-    return basic.powerMod(a, Math.pow(b, -1), m);
-  }
+  if (b < 1) {}
 };
 
killedBy: numbers powerMod should return the answer to a^b mod m
statusReason: undefined == 6

[Timeout] UnaryOperator
numbers.js/lib/numbers/basic.js:387:42
 
   if (b === -1) return basic.modInverse(a, m);
   if (b < 1) {
-    return basic.powerMod(a, Math.pow(b, -1), m);
+    return basic.powerMod(a, Math.pow(b, +1), m);
   }
 };

[Killed] UnaryOperator
numbers.js/lib/numbers/basic.js:399:7
  * @return {Array} [a, x, y] a is the GCD. x and y are the values such that ax + by = gcd(a, b) .
  */
 basic.egcd = function (a, b) {
-  a = +a;
+  a = -a;
   b = +b;
   // Same as isNaN() but faster
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  3,
  -1,
  0
]

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:406:44
     return [NaN, NaN, NaN];
   }
   //Same as !isFinite() but faster
-  if (a === Infinity || a === -Infinity || b === Infinity || b === -Infinity) {
+  if (a === Infinity || a === -Infinity || true || b === -Infinity) {
     return [Infinity, Infinity, Infinity];
   }
killedBy: numbers egcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:406:25
     return [NaN, NaN, NaN];
   }
   //Same as !isFinite() but faster
-  if (a === Infinity || a === -Infinity || b === Infinity || b === -Infinity) {
+  if (a === Infinity || a !== -Infinity || b === Infinity || b === -Infinity) {
     return [Infinity, Infinity, Infinity];
   }
killedBy: numbers egcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] ArrayDeclaration
numbers.js/lib/numbers/basic.js:407:12
   }
   //Same as !isFinite() but faster
   if (a === Infinity || a === -Infinity || b === Infinity || b === -Infinity) {
-    return [Infinity, Infinity, Infinity];
+    return [];
   }
   // Checks if a or b are decimals
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[]

should loosely deep-equal

[
  Infinity,

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:410:7
     return [Infinity, Infinity, Infinity];
   }
   // Checks if a or b are decimals
-  if ((a % 1 !== 0) || (b % 1 !== 0)) {
+  if (false) {
     throw new Error("Can only operate on integers");
   }
killedBy: numbers egcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:410:8
     return [Infinity, Infinity, Infinity];
   }
   // Checks if a or b are decimals
-  if ((a % 1 !== 0) || (b % 1 !== 0)) {
+  if ((false) || (b % 1 !== 0)) {
     throw new Error("Can only operate on integers");
   }
killedBy: numbers egcd should throw an exception when given a decimal
statusReason: Missing expected exception.

[Killed] StringLiteral
numbers.js/lib/numbers/basic.js:411:21
   }
   // Checks if a or b are decimals
   if ((a % 1 !== 0) || (b % 1 !== 0)) {
-    throw new Error("Can only operate on integers");
+    throw new Error("");
   }
   var signX = (a < 0) ? -1 : 1,
killedBy: numbers egcd should throw an exception when given a decimal
statusReason: The input did not match the regular expression /Can only operate on integers/. Input:

'Error'

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:413:16
   if ((a % 1 !== 0) || (b % 1 !== 0)) {
     throw new Error("Can only operate on integers");
   }
-  var signX = (a < 0) ? -1 : 1,
+  var signX = (true) ? -1 : 1,
     signY = (b < 0) ? -1 : 1,
     x = 0,
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  3,
  -1,
  0
]

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:413:16
   if ((a % 1 !== 0) || (b % 1 !== 0)) {
     throw new Error("Can only operate on integers");
   }
-  var signX = (a < 0) ? -1 : 1,
+  var signX = (a >= 0) ? -1 : 1,
     signY = (b < 0) ? -1 : 1,
     x = 0,
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  3,
  -1,
  0
]

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:414:14
     throw new Error("Can only operate on integers");
   }
   var signX = (a < 0) ? -1 : 1,
-    signY = (b < 0) ? -1 : 1,
+    signY = (true) ? -1 : 1,
     x = 0,
     y = 1,
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  3,
  0,
  -1
]

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:414:14
     throw new Error("Can only operate on integers");
   }
   var signX = (a < 0) ? -1 : 1,
-    signY = (b < 0) ? -1 : 1,
+    signY = (b >= 0) ? -1 : 1,
     x = 0,
     y = 1,
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  3,
  0,
  -1
]

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:423:10
   a = Math.abs(a);
   b = Math.abs(b);
 
-  while (a !== 0) {
+  while (a === 0) {
     q = Math.floor(b / a);
     r = b % a;
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  0,
  0,
  1
]

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:423:10
   a = Math.abs(a);
   b = Math.abs(b);
 
-  while (a !== 0) {
+  while (false) {
     q = Math.floor(b / a);
     r = b % a;
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  0,
  0,
  1
]

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:424:20
   b = Math.abs(b);
 
   while (a !== 0) {
-    q = Math.floor(b / a);
+    q = Math.floor(b * a);
     r = b % a;
     m = x - oldX * q;
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  1,
  10,
  1
]

[Timeout] ArithmeticOperator
numbers.js/lib/numbers/basic.js:425:9
 
   while (a !== 0) {
     q = Math.floor(b / a);
-    r = b % a;
+    r = b * a;
     m = x - oldX * q;
     n = y - oldY * q;

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:426:13
   while (a !== 0) {
     q = Math.floor(b / a);
     r = b % a;
-    m = x - oldX * q;
+    m = x - oldX / q;
     n = y - oldY * q;
     b = a;
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  1,
  0.5,
  1
]

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:426:9
   while (a !== 0) {
     q = Math.floor(b / a);
     r = b % a;
-    m = x - oldX * q;
+    m = x + oldX * q;
     n = y - oldY * q;
     b = a;
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  1,
  -2,
  1
]

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:427:13
     q = Math.floor(b / a);
     r = b % a;
     m = x - oldX * q;
-    n = y - oldY * q;
+    n = y - oldY / q;
     b = a;
     a = r;
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  5,
  -3,
  NaN
]

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:427:9
     q = Math.floor(b / a);
     r = b % a;
     m = x - oldX * q;
-    n = y - oldY * q;
+    n = y + oldY * q;
     b = a;
     a = r;
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  5,
  5,
  3
]

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:435:14
     oldX = m;
     oldY = n;
   }
-  return [b, signX * x, signY * y];
+  return [b, signX / x, signY * y];
 };
 /**
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  3,
  Infinity,
  1
]

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:435:25
     oldX = m;
     oldY = n;
   }
-  return [b, signX * x, signY * y];
+  return [b, signX * x, signY / y];
 };
 /**
killedBy: numbers egcd should return the array [a, x, y] which is the solved linear equation for GCD
statusReason: Expected values to be loosely deep-equal:

[
  3,
  1,
  Infinity
]

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:444:36
  * @param {Number} Modulo m.
  * @return {Number} if true, return number, else throw error.
  */
-basic.modInverse = function (a, m) {
-  var r = basic.egcd(a, m);
-  if (r[0] !== 1) throw new Error('No modular inverse exists');
-  return r[1] % m;
-};
+basic.modInverse = function (a, m) {};
 
 
killedBy: numbers modInverse will return the modulo m inverse of a
statusReason: undefined == 1

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:446:7
  */
 basic.modInverse = function (a, m) {
   var r = basic.egcd(a, m);
-  if (r[0] !== 1) throw new Error('No modular inverse exists');
+  if (false) throw new Error('No modular inverse exists');
   return r[1] % m;
 };
killedBy: numbers modInverse will throw an exception if no modular inverse exists
statusReason: Missing expected exception.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:446:7
  */
 basic.modInverse = function (a, m) {
   var r = basic.egcd(a, m);
-  if (r[0] !== 1) throw new Error('No modular inverse exists');
+  if (r[0] === 1) throw new Error('No modular inverse exists');
   return r[1] % m;
 };
killedBy: numbers modInverse will return the modulo m inverse of a
statusReason: No modular inverse exists

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:447:10
 basic.modInverse = function (a, m) {
   var r = basic.egcd(a, m);
   if (r[0] !== 1) throw new Error('No modular inverse exists');
-  return r[1] % m;
+  return r[1] * m;
 };
 
killedBy: numbers modInverse will return the modulo m inverse of a
statusReason: 5 == 1

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:458:56
  * @param {Number} second number.
  * @param {Number} epsilon.
  */
-basic.numbersEqual = function (first, second, epsilon) {
-  if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
-  return (first - second) < epsilon && (first - second) > -epsilon;
-};
+basic.numbersEqual = function (first, second, epsilon) {};
 
 /**
killedBy: numbers should be able to check equality of two floating point numbers
statusReason: undefined == true

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:459:38
  * @param {Number} epsilon.
  */
 basic.numbersEqual = function (first, second, epsilon) {
-  if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
+  if (typeof (first) !== 'number' || true || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
   return (first - second) < epsilon && (first - second) > -epsilon;
 };
killedBy: numbers should be able to check equality of two floating point numbers
statusReason: First and Second must be numbers.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:459:38
  * @param {Number} epsilon.
  */
 basic.numbersEqual = function (first, second, epsilon) {
-  if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
+  if (typeof (first) !== 'number' || typeof second === 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
   return (first - second) < epsilon && (first - second) > -epsilon;
 };
killedBy: numbers should be able to check equality of two floating point numbers
statusReason: First and Second must be numbers.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:460:10
  */
 basic.numbersEqual = function (first, second, epsilon) {
   if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
-  return (first - second) < epsilon && (first - second) > -epsilon;
+  return first - second >= epsilon && (first - second) > -epsilon;
 };
 
killedBy: numbers should be able to check equality of two floating point numbers
statusReason: false == true

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:460:41
  */
 basic.numbersEqual = function (first, second, epsilon) {
   if (typeof (first) !== 'number' || typeof (second) !== 'number' || typeof (epsilon) !== 'number') throw new Error("First and Second must be numbers.");
-  return (first - second) < epsilon && (first - second) > -epsilon;
+  return (first - second) < epsilon && (first + second) > -epsilon;
 };
 
killedBy: numbers should be able to check equality of two floating point numbers
statusReason: true == false

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:472:42
  * @param {Number} Steps to fall
  * @returns {Number} Result
  */
-basic.fallingFactorial = function (n, k) {
-  var i = (n - k + 1),
-    r = 1;
-
-  if (n < 0) {
-    throw new Error("n cannot be negative.");
-  }
-  if (k > n) {
-    throw new Error("k cannot be greater than n.");
-  }
-
-  while (i <= n) {
-    r *= i++;
-  }
-
-  return r;
-};
+basic.fallingFactorial = function (n, k) {};
 
 /**
killedBy: numbers fallingFactorial should return correct answers
statusReason: undefined == 1

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:473:12
  * @returns {Number} Result
  */
 basic.fallingFactorial = function (n, k) {
-  var i = (n - k + 1),
+  var i = (n - k - 1),
     r = 1;
 
killedBy: numbers fallingFactorial should return correct answers
statusReason: -0 == 1

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:473:12
  * @returns {Number} Result
  */
 basic.fallingFactorial = function (n, k) {
-  var i = (n - k + 1),
+  var i = (n + k + 1),
     r = 1;
 
killedBy: numbers fallingFactorial should return correct answers
statusReason: 1 == 5040

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:476:14
   var i = (n - k + 1),
     r = 1;
 
-  if (n < 0) {
-    throw new Error("n cannot be negative.");
-  }
+  if (n < 0) {}
   if (k > n) {
     throw new Error("k cannot be greater than n.");
killedBy: numbers fallingFactorial should return correct answers
statusReason: /k is greater than n/

[Killed] StringLiteral
numbers.js/lib/numbers/basic.js:477:21
     r = 1;
 
   if (n < 0) {
-    throw new Error("n cannot be negative.");
+    throw new Error("");
   }
   if (k > n) {
killedBy: numbers fallingFactorial should return correct answers
statusReason: /k is greater than n/

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:479:7
   if (n < 0) {
     throw new Error("n cannot be negative.");
   }
-  if (k > n) {
+  if (true) {
     throw new Error("k cannot be greater than n.");
   }
killedBy: numbers fallingFactorial should return correct answers
statusReason: k cannot be greater than n.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:479:7
   if (n < 0) {
     throw new Error("n cannot be negative.");
   }
-  if (k > n) {
+  if (k <= n) {
     throw new Error("k cannot be greater than n.");
   }
killedBy: numbers fallingFactorial should return correct answers
statusReason: k cannot be greater than n.

[NoCoverage] StringLiteral
numbers.js/lib/numbers/basic.js:480:21
     throw new Error("n cannot be negative.");
   }
   if (k > n) {
-    throw new Error("k cannot be greater than n.");
+    throw new Error("");
   }
 

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:483:10
     throw new Error("k cannot be greater than n.");
   }
 
-  while (i <= n) {
+  while (false) {
     r *= i++;
   }
killedBy: numbers fallingFactorial should return correct answers
statusReason: 1 == 5040

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:483:10
     throw new Error("k cannot be greater than n.");
   }
 
-  while (i <= n) {
+  while (i < n) {
     r *= i++;
   }
killedBy: numbers fallingFactorial should return correct answers
statusReason: 720 == 5040

[Timeout] UpdateOperator
numbers.js/lib/numbers/basic.js:484:10
   }
 
   while (i <= n) {
-    r *= i++;
+    r *= i--;
   }
 

[Killed] BlockStatement
numbers.js/lib/numbers/basic.js:498:37
  * @return {Number} number of ordered variations
  */
 
-basic.permutation = function (n, k) {
-  if (n <= 0) {
-    throw new Error("n cannot be less than or equal to 0.");
-  }
-  if (n < k) {
-    throw new Error("k cannot be greater than k.");
-  }
-  var binomial = basic.binomial(n, k);
-  var permutation = binomial * basic.factorial(k);
-  return permutation;
-};
+basic.permutation = function (n, k) {};
 
killedBy: numbers permutation should return the permutation coefficient (n permute k) of two numbers
statusReason: undefined == 1

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:499:7
  */
 
 basic.permutation = function (n, k) {
-  if (n <= 0) {
+  if (true) {
     throw new Error("n cannot be less than or equal to 0.");
   }
killedBy: numbers permutation should return the permutation coefficient (n permute k) of two numbers
statusReason: n cannot be less than or equal to 0.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:499:7
  */
 
 basic.permutation = function (n, k) {
-  if (n <= 0) {
+  if (n > 0) {
     throw new Error("n cannot be less than or equal to 0.");
   }
killedBy: numbers permutation should return the permutation coefficient (n permute k) of two numbers
statusReason: n cannot be less than or equal to 0.

[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:502:7
   if (n <= 0) {
     throw new Error("n cannot be less than or equal to 0.");
   }
-  if (n < k) {
+  if (true) {
     throw new Error("k cannot be greater than k.");
   }
killedBy: numbers permutation should return the permutation coefficient (n permute k) of two numbers
statusReason: k cannot be greater than k.

[Killed] EqualityOperator
numbers.js/lib/numbers/basic.js:502:7
   if (n <= 0) {
     throw new Error("n cannot be less than or equal to 0.");
   }
-  if (n < k) {
+  if (n >= k) {
     throw new Error("k cannot be greater than k.");
   }
killedBy: numbers permutation should return the permutation coefficient (n permute k) of two numbers
statusReason: k cannot be greater than k.

[Killed] ArithmeticOperator
numbers.js/lib/numbers/basic.js:506:21
     throw new Error("k cannot be greater than k.");
   }
   var binomial = basic.binomial(n, k);
-  var permutation = binomial * basic.factorial(k);
+  var permutation = binomial / basic.factorial(k);
   return permutation;
 };
killedBy: numbers permutation should return the permutation coefficient (n permute k) of two numbers
statusReason: 0.20833333333333334 == 120
