[Killed] ConditionalExpression
numbers.js/lib/numbers/basic.js:54:7
  * @return {Number} difference.
  */
 basic.subtraction = function (arr) {
-  if (Object.prototype.toString.call(arr) === '[object Array]') {
+  if (true) {
     var total = arr[0];
     if (typeof (total) !== 'number') {
killedBy: numbers subtraction should throw an exception when given anything but an array
statusReason: The input did not match the regular expression /Input must be of type Array/. Input:

'Error: All elements in array must be numbers'

[Killed] UpdateOperator
numbers.js/lib/numbers/basic.js:59:54
     if (typeof (total) !== 'number') {
       throw new Error('All elements in array must be numbers');
     }
-    for (var i = 1, length = arr.length; i < length; i++) {
+    for (var i = 1, length = arr.length; i < length; i--) {
       if (typeof (arr[i]) === 'number') {
         total -= arr[i];
killedBy: numbers subtraction should return the difference of items in an array
statusReason: All elements in array must be numbers
